# Використовуйте офіційний образ Node.js як базовий образ
FROM node:16

# Встановіть робочу директорію в контейнері
WORKDIR /app

# Скопіюйте package.json і package-lock.json
COPY package*.json ./

# Встановіть залежності
RUN npm install

# Скопіюйте всі файли проекту в робочу директорію контейнера
COPY . .

# Збудуйте проект (якщо потрібно)
RUN npm run build

# Експортуйте порт для доступу до сервера
EXPOSE 8080

# Команда для запуску вашого додатку
CMD ["npx", "live-server", "public", "--port=8080"]
